// События (загружаются из файла)
const eventsData = [
    {
        "id": 1787910602829,
        "name": "Выставка \"Всё напоказ?\" ",
        "type": "exhibition",
        "address": "1-й Казачий пер., д. 6, стр. 1",
        "coords": {
            "lat": 55.735145,
            "lng": 37.622801
        },
        "start_date": "2027-04-02T00:00",
        "end_date": "2027-06-30T00:00",
        "price": 0,
        "description": "Большой выставочный проект, выполненный в формате театрализованной инсталляции. Экспозиция исследует феномен камерной городской усадьбы на 1-м Казачьем переулке и её культурную историю.",
        "photo": "images/img1",
        "gallery": [
            "images/img2",
            "images/img3"
        ]
    },
    {
        "id": 1787911075363,
        "name": "Выставка \"Заграница - это миф?\"",
        "type": "exhibition",
        "address": "ул. Верхняя Масловка, д. 3, г. Москва",
        "coords": {
            "lat": 55.792038,
            "lng": 37.567357
        },
        "start_date": "2027-01-30T00:00",
        "end_date": "2027-05-17T00:00",
        "price": 0,
        "description": "Выставка посвящена тому, как советские художники открывали для себя зарубежный мир. Экспозиция показывает, каким они представляли Запад и как этот опыт отразился в их работах.",
        "photo": "images/img5",
        "gallery": [
            "images/img4",
            "images/img6"
        ]
    },
    {
        "id": 1787911622584,
        "name": "Спецпоказ \"Киноглаз\"",
        "type": "cinema",
        "address": "Ходынская улица, 2 стр. 1",
        "coords": {
            "lat": 55.770304,
            "lng": 37.564608
        },
        "start_date": "2027-05-10T00:00",
        "end_date": "2027-05-10T00:00",
        "price": 0,
        "description": "Документальный фильм о новом государстве — СССР. Представляет собой сборник небольших эпизодов о жизни Советского Союза, объединенных в серию \"Жизнь врасплох\". Большое внимание уделено детям и их пионерской организации. Также показаны кооперативы того времени, слон, борьба с туберкулезом, скорая медицинская помощь, сумасшедший дом, занятия по физике для рабочих",
        "photo": "images/img7",
        "gallery": [
            "images/img8",
            "images/img9"
        ]
    },
    {
        "id": 1787911759358,
        "name": "Выставка \"Свет идет из-под земли\"",
        "type": "exhibition",
        "address": "галерея БУДУЩЕЕ/FUTURO на Винзаводе",
        "coords": {
            "lat": 55.756052,
            "lng": 37.665857
        },
        "start_date": "2027-04-14T00:00",
        "end_date": "2027-05-22T00:00",
        "price": 0,
        "description": "-",
        "photo": "images/img12",
        "gallery": [
            "images/img10"
        ]
    },
    {
        "id": 1787911846564,
        "name": "Спектакль-урок \"Какой может быть поэзия\"",
        "type": "theater",
        "address": "ул. Покровка, д. 50/2, стр. 1",
        "coords": {
            "lat": 55.763498,
            "lng": 37.655275
        },
        "start_date": "2027-04-19T00:00",
        "end_date": "2027-04-19T00:00",
        "price": 3000,
        "description": "Режиссёр Анна Потебня выстраивает взаимодействие зала со сценой: зритель тоже включается в разбор — что считать поэзией, по каким законам она существует и где проходит граница между искренним высказыванием и формой. В основе лежит текст Егора Зайцева, который сам становится проводником в этом разговоре, двигаясь от классики к современным практикам. Спектакль говорит о природе стиха, его ритме, интонации и свободе от рамок, позволяя взглянуть на поэзию шире привычного канона.",
        "photo": "images/img13",
        "gallery": [
            "images/img14",
            "images/img15"
        ]
    },
    {
        "id": 1787911941516,
        "name": "Спектакль \"Очень простая история\"",
        "type": "theater",
        "address": "ул. Академика Пилюгина, д. 2",
        "coords": {
            "lat": 55.674016,
            "lng": 37.542069
        },
        "start_date": "2027-04-21T00:00",
        "end_date": "2027-04-28T00:00",
        "price": 700,
        "description": "В этой удивительной комедии возможно все: любящие друг друга молодые парень и девушка, так же, как Ромео и Джульетта, страдающие от непонимания родителей. Разговаривающие Корова, Лошадь, Пес, Петух и даже Свинья, мечтающая летать. Любящий всех неудачник сосед, выброшенный на обочину жизни. В этой Очень простой истории, верные и чистые сердцем домашние животные, приходят на помощь суетным людям, чтобы спасти жизнь ребенка. Здесь, на горошине Земли.",
        "photo": "images/img16",
        "gallery": [
            "images/img17",
            "images/img18"
        ]
    },
    {
        "id": 1787912092164,
        "name": "Спектакль \"Сказка Арденнского леса\"",
        "type": "theater",
        "address": "Б. Гнездниковский пер., д. 10",
        "coords": {
            "lat": 55.763366,
            "lng": 37.605724
        },
        "start_date": "2027-04-16T00:00",
        "end_date": "2027-04-16T00:00",
        "price": 900,
        "description": "-",
        "photo": "images/img19",
        "gallery": [
            "images/img20"
        ]
    },
    {
        "id": 1787912169514,
        "name": "Экскурсия \"Закулисье\"",
        "type": "other",
        "address": "пер.Камергерский, д. 3А",
        "coords": {
            "lat": 55.760232,
            "lng": 37.613143
        },
        "start_date": "2027-02-10T00:00",
        "end_date": "2027-02-17T00:00",
        "price": 1300,
        "description": "Вам откроется уникальная возможность зайти за кулисы и даже в арт-фойе, где актеры готовятся к выходу и отдыхают между сценами. Также вы побываете в грим-уборных О. П. Табакова, К. С. Станиславского, О. Н. Ефремова, в мемориальном кабинете Вл. И. Немировича-Данченко и в Сталинской ложе, услышите истории о жизни театра и его служащих.",
        "photo": "images/img21",
        "gallery": [
            "images/img22",
            "images/img23"
        ]
    },
    {
        "id": 1787912256272,
        "name": "Выставка \"5 углов\"",
        "type": "exhibition",
        "address": "Трубниковский переулок, 6",
        "coords": {
            "lat": 55.753303,
            "lng": 37.587841
        },
        "start_date": "2027-02-13T00:00",
        "end_date": "2027-05-10T00:00",
        "price": 500,
        "description": "Проект о художниках и коллекционерах уличного искусства. В экспозиции представлено более 150 работ от 63 авторов.",
        "photo": "images/img24",
        "gallery": [
            "images/img25",
            "images/img26"
        ]
    },
    {
        "id": 1787912346746,
        "name": "Выставка \"С листа\"",
        "type": "exhibition",
        "address": "ул. Маросейка, д. 11/4",
        "coords": {
            "lat": 55.757805,
            "lng": 37.635772
        },
        "start_date": "2027-02-27T00:00",
        "end_date": "2027-05-17T00:00",
        "price": 400,
        "description": "Новый проект одной из ключевых современных художниц России — Ольги Чернышевой. Экспозиция показывает рисунок как способ мыслить, наблюдать и фиксировать постоянные изменения жизни",
        "photo": "images/img27",
        "gallery": [
            "images/img28",
            "images/img29"
        ]
    },
    {
        "id": 1787912415942,
        "name": "Выставка \"Матисс и Пикассо. Цвет и форма\"",
        "type": "exhibition",
        "address": "Новая Третьяковка, Крымский Вал, 10",
        "coords": {
            "lat": 55.734898,
            "lng": 37.605739
        },
        "start_date": "2027-02-17T00:00",
        "end_date": "2027-05-31T00:00",
        "price": 350,
        "description": "Камерный художественный проект, посвящённый диалогу двух мастеров модернизма — Анри Матисса и Пабло Пикассо. Экспозиция показывает, как их открытия в цвете и форме повлияли на русский авангард и искусство XX века.",
        "photo": "images/img30",
        "gallery": [
            "images/img31",
            "images/img32"
        ]
    },
    {
        "id": 1787912492622,
        "name": "Спектакль \"Бег\"",
        "type": "theater",
        "address": "Театр Вахтангова",
        "coords": {
            "lat": 55.749729,
            "lng": 37.591575
        },
        "start_date": "2027-04-28T00:00",
        "end_date": "2027-06-14T00:00",
        "price": 5900,
        "description": "Провокационный спектакль в фирменном стиле Бутусова. Мрачная красота и драма с легким привкусом абсурда и ночного кошмара. История разбита на восемь снов, в каждом - свой герой и свой взгляд, под ритмы современной рок-музыки и старый блюз",
        "photo": "images/img33",
        "gallery": [
            "images/img34",
            "images/img35"
        ]
    },
    {
        "id": 1787912582925,
        "name": "Спектакль \"Тихий Дон\"",
        "type": "theater",
        "address": "Дворец на Яузе",
        "coords": {
            "lat": 55.78404,
            "lng": 37.704673
        },
        "start_date": "2027-05-13T00:00",
        "end_date": "2027-05-13T00:00",
        "price": 2000,
        "description": "Гастроли петербургской \"Мастерской\" - 8-ми часовой спектакль в двух частях и четырех действиях. Любовная история разворачивается параллельно с войной, революцией и полным сломом привычного мира",
        "photo": "images/img36",
        "gallery": [
            "images/img37",
            "images/img38"
        ]
    },
    {
        "id": 1787912665498,
        "name": "Кинопоказ \"Убийство священного оленя / The Killing of a Sacred Deer\"",
        "type": "cinema",
        "address": "Ходынская улица, 2 стр. 1",
        "coords": {
            "lat": 55.770304,
            "lng": 37.564608
        },
        "start_date": "2027-04-10T00:00",
        "end_date": "2027-04-17T00:00",
        "price": 445,
        "description": "Успешный кардиохирург Стивен живет с женой Анной и двумя детьми внешне благополучной жизнью, пока в его окружении не появляется Мартин — замкнутый подросток, связанный с тревожным эпизодом из прошлого врача. Постепенно юноша все теснее сближается с семьей, после чего с детьми начинают происходить странные и необъяснимые события, неподвластные медицине. Попытка Стивена сохранить контроль над ситуацией приводит к решению, последствия которого невозможно отменить",
        "photo": "images/img39",
        "gallery": [
            "images/img40",
            "images/img41"
        ]
    },
    {
        "id": 1787912745216,
        "name": "Кинопоказ \"Космос засыпает\"",
        "type": "cinema",
        "address": "Ходынская улица, 2 стр. 1",
        "coords": {
            "lat": 55.770304,
            "lng": 35.564608
        },
        "start_date": "2027-03-21T00:00",
        "end_date": "2027-04-21T00:00",
        "price": 450,
        "description": "Паша учится в Петербурге на инженера-ракетостроителя в престижном университете и мечтает о космосе. Преподаватели считают его большим талантом и прочат успех. Внезапно Паша получает печальную весть из дома и отправляется помогать маме и младшему брату в родной и далекий поселок Шойна, где дома тонут в песках. Но возможно ли отпустить мечту?",
        "photo": "images/img42",
        "gallery": [
            "images/img43",
            "images/img44"
        ]
    },
    {
        "id": 1787912822266,
        "name": "Кинопоказ \" Посторонний / L'Étranger\"",
        "type": "cinema",
        "address": "Ходынская улица, 2 стр. 1",
        "coords": {
            "lat": 55.770304,
            "lng": 37.564608
        },
        "start_date": "2027-03-03T00:00",
        "end_date": "2027-04-21T00:00",
        "price": 450,
        "description": "Алжир, 1938 год. Мерсо, красивый и замкнутый молодой человек, едет на похороны матери, не проронив ни слезы. Вернувшись к своей повседневной жизни, он погружается в скуку, внутреннюю пустоту и роман с Мари. Всё кажется предсказуемым и бессмысленным, но в один невыносимо жаркий день на пляже происходит событие, из-за которого жизнь Мерсо и всех, кто его окружает, полностью меняется.​​«Посторонний» — одноименная адаптацию романа Альбера Камю, который переведён на 68 языков и является третьим по популярности франкоязычным романом в мире.",
        "photo": "images/img45",
        "gallery": [
            "images/img46",
            "images/img47"
        ]
    },
    {
        "id": 1787912881148,
        "name": "Кинопоказ \"Картины дружеских связей\"",
        "type": "cinema",
        "address": "Ходынская улица, 2 стр. 1",
        "coords": {
            "lat": 55.770304,
            "lng": 37.564608
        },
        "start_date": "2027-03-21T00:00",
        "end_date": "2027-04-21T00:00",
        "price": 450,
        "description": "Один зимний день и одна ночь из жизни тридцатилетних друзей, бывших однокурсников. Им нужно преодолеть бытовые трудности, чтобы встретиться и проводить Сашу, надолго покидающего Москву. Фильм получил награды фестиваля актуального российского кино \"Маяк 2025\" в номинациях \"Лучшая работа режиссера\" и \"Лучшая женская роль\"(Мария Карпова)",
        "photo": "images/img48",
        "gallery": [
            "images/img49",
            "images/img50"
        ]
    },
    {
        "id": 1787913165094,
        "name": "Выставка \"Литературный этаж\"",
        "type": "exhibition",
        "address": "Гнездниковский пер., д.10",
        "coords": {
            "lat": 55.763366,
            "lng": 37.605724
        },
        "start_date": "2026-09-06T00:00",
        "end_date": "2026-12-31T00:00",
        "price": 790,
        "description": "На выставке собраны интересные факты о столице, кинематографе, культуре.",
        "photo": "images/img51",
        "gallery": [
            "images/img52",
            "images/img53"
        ]
    },
    {
        "id": 1787913276588,
        "name": "Спектакль \"Кабаре\"",
        "type": "theater",
        "address": "Театр на Цветном",
        "coords": {
            "lat": 55.770077,
            "lng": 37.620319
        },
        "start_date": "2027-04-19T00:00",
        "end_date": "2027-04-21T00:00",
        "price": 8900,
        "description": "Мюзикл по одноименной пьесе, переносящий в Берлин 30-х. Размышления про любовь, тревогу и ощущение, что праздник вот-вот закончится - постановка Егора Дружинина через его узнаваемый стиль",
        "photo": "images/img54",
        "gallery": [
            "images/img55",
            "images/img56"
        ]
    },
    {
        "id": 1787913400542,
        "name": "Спектакль \"Почему Я?\"",
        "type": "theater",
        "address": "Театр Эстрады, МДМ",
        "coords": {
            "lat": 55.744747,
            "lng": 37.610587
        },
        "start_date": "2027-04-13T00:00",
        "end_date": "2027-04-13T00:00",
        "price": 6000,
        "description": "Тонкий и остроумный моноспектакль Иры Горбачевой. Личный разговор через истории - актриса расскажет про комичные и драматические моменты из жизни, которые влияют на судьбу и личность каждой женщины",
        "photo": "images/img57",
        "gallery": [
            "images/img58",
            "images/img59"
        ]
    },
    {
        "id": 1787913514014,
        "name": "Спектакль \"Кабала Святош\"",
        "type": "theater",
        "address": "МХТ им.А.П.Чехова",
        "coords": {
            "lat": 55.760232,
            "lng": 37.613143
        },
        "start_date": "2027-05-22T00:00",
        "end_date": "2027-05-23T00:00",
        "price": 20200,
        "description": "Знаковая для MXT и роковая для Булгакова пьеса \"Кабала святош\" возвращается на сцену. С безукоризненным актерским составом: Хабенский, Цискаридзе, Ребенок и другие. Про театр внутри театра, придворные игры и напряжение между правдой и удобной ложью",
        "photo": "images/img60",
        "gallery": [
            "images/img61",
            "images/img62"
        ]
    },
    {
        "id": 1787913663966,
        "name": "Кинопоказ \"Трудности перевода\"",
        "type": "cinema",
        "address": "Старокирочный, 16/2с1",
        "coords": {
            "lat": 55.768132,
            "lng": 37.683976
        },
        "start_date": "2027-04-22T18:00",
        "end_date": "2027-04-22T18:00",
        "price": 0,
        "description": "Бесплатно при покупке напитка в баре",
        "photo": "images/img63",
        "gallery": [
            "images/img64",
            "images/img65"
        ]
    },
    {
        "id": 1787913773012,
        "name": "Кинопоказ \"Леди Бёрд\"",
        "type": "cinema",
        "address": "Старокирочный, 16/2с1",
        "coords": {
            "lat": 55.768132,
            "lng": 37.683976
        },
        "start_date": "2027-04-26T18:00",
        "end_date": "2027-04-26T18:00",
        "price": 0,
        "description": "Бесплатно при покупке напитка в баре",
        "photo": "images/img66",
        "gallery": [
            "images/img67",
            "images/img68"
        ]
    },
    {
        "id": 1787913866588,
        "name": "Выставка \"Под маской\"",
        "type": "exhibition",
        "address": "Ленинградский пр-т, д. 15, стр. 11",
        "coords": {
            "lat": 55.78065,
            "lng": 37.57143
        },
        "start_date": "2027-02-13T00:00",
        "end_date": "2027-05-24T00:00",
        "price": 0,
        "description": "Проект о маскарадах и праздничных традициях в русской культуре. В экспозиции можно увидеть работы Маковского, Судейкина, Виноградова и других художников из музейных и частных коллекции. Пройдя по залам экспозиции, вы увидите, как на протяжении целого столетия художники становились участниками балов-маскарадов, придумывали аксессуары и декорации, писали моделей в вечерних нарядах, изображали маркиз и маркизов, арлекинов и пьеро, эльфов и \"газовых фей\".Вас ждет по-настоящему театральная выставка: тканевые занавесы, зеркала, ожившие архивные фотоснимки участников праздничных вечеров прошлых столетий, тени героев спектакля \"Маскарад\".",
        "photo": "images/img69",
        "gallery": [
            "images/img70",
            "images/img71"
        ]
    }
];
